/**
 * k025 产品类型 - pdTp - 102M
 * 0：科目
 * 1：活期
 * 2：定期
 * 3：贷款
 * 4：透支
 * 9：资金(内部账)
 */
export const pdTpObj = {
    0: '0',
    1: '1',
    2: '2',
    3: '3',
    4: '4',
    9: '9'
}
/**
 * k025 账户类型 - accTp - 105G
 * 1：基本户；
 * 2：一般户；
 * 3：专用存款户；
 * 4：临时存款户；
 * 5：个人存款户（储蓄户）；
 * 6：协定（理财）户；
 * 7：公积金活期户（个人）
 * E外币对公账户 
 * F保证金账户 
 * G外币保证金账户
 */
export const accTpObj = {
    0: '0',
    1: '1',
    2: '2',
    3: '3',
    4: '4',
    5: '5',
    6: '6',
    7: '7',
    E: 'E',
    F: 'F',
    G: 'G'
}
/**
 * k025 账户状态 - acctSt - 1058
 * 1：正常
 * 0：开户待确认
 * 3：挂失结清
 * 4：开户更正
 * 5：临时销户
 * 6：转久悬
 * *：销户
 * #：计息结束
 */
export const acctStObj = {
    1: '1',
    0: '0',
    3: '3',
    4: '4',
    5: '5',
    6: '6',
    '*': '*',
    '#': '#'
}
/**
 * k025 账户冻结状态 - accFrzSt - 1059
 * 0: 正常
 * 1: 完全冻结
 * 2：只进不出
 * 3：部分冻结
 */
export const accFrzStObj = {
    0: '0',
    1: '1',
    2: '2',
    3: '3'
}
/**
 * k025 介质状态 - medmSt - 1057
 * 1：正常
 * 2：挂失
 * 3：挂失换证
 * 4：正常换证
 * 5：撤销
 * *：销户
 * 6：损坏更换
 * #：未激活
 * 8：待销户
 */
export const medmStObj = {
    1: '1',
    2: '2',
    3: '3',
    4: '4',
    5: '5',
    '*': '*',
    6: '6',
    '#': '#',
    8: '8',
    0: '0'
}
/**
 * k025 客户类型 - cstTp - 107K
 * 0：公用
 * 1：个人
 * 2：公司
 * 3：机构
 * 4：金融同业
 * 5：内部员工
 * 6：金融机构
 */
export const cstTpObj = {
    0: '0',
    1: '1',
    2: '2',
    3: '3',
    4: '4',
    5: '5',
    6: '6'
}

/**
 * k025 内部户定活标志 - trmInnrAcctFlg - 0720
 * 1：活期
 * 2：定期
 */
export const trmInnrAcctFlgObj = {
    1: '1', // 活期
    2: '2', // 定期
}

/**
 * k025 账户止付状态 - accFbdPymtSt - 105A
    0: '正常',
    1: '全部止付',
    2: '只进不出',
    3: '部分止付',
 */
export const accFbdPymtStObj = {
    0: '0',
    1: '1',
    2: '2',
    3: '3',
}